yearnext/ysf/bsp/stm32f1xx/map/map_gpio.c
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       enable gpio
 * @param       [in/out]  *dev                    gpio block
 * @return      [in/out]  HAL_ERR_NONE            enable success
 * @return      [in/out]  HAL_ERR_FAIL            enable failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Open(struct Hal_GPIO_Device *dev)
{
    return Map_GPIO_Open(dev->Port);
}

/**
 *******************************************************************************
 * @brief       disable gpio
 * @param       [in/out]  port                    gpio port
 * @return      [in/out]  HAL_ERR_NONE            disable success
 * @return      [in/out]  HAL_ERR_FAIL            disable failed
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Close(uint8_t port)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    
    _close(port);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       disable gpio
 * @param       [in/out]  *dev                    gpio block
 * @return      [in/out]  HAL_ERR_NONE            disable success
 * @return      [in/out]  HAL_ERR_FAIL            disable failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Close(struct Hal_GPIO_Device *dev)
{
    return Map_GPIO_Close(dev->Port);
}

/**
 *******************************************************************************
 * @brief       gpio init
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pin                     gpio pin
 * @param       [in/out]  io                      config io mode
 * @param       [in/out]  mode                    config gpio mode
 * @return      [in/out]  HAL_ERR_NONE            init success
 * @return      [in/out]  HAL_ERR_FAIL            init failed
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Init(uint8_t port, uint8_t pin, uint8_t io,uint8_t mode)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pin));
    hal_assert(IS_PIN_MODE_INVAILD(mode))

	uint8_t setMode = io | mode;
	
    _config(port, pin, setMode);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       init gpio
 * @param       [in/out]  *dev                    gpio block
 * @return      [in/out]  HAL_ERR_NONE            init success
 * @return      [in/out]  HAL_ERR_FAIL            init failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Init(struct Hal_GPIO_Device *dev)
{
    return Map_GPIO_Init(dev->Port, dev->Pin, dev->IO, dev->Mode);
}

/**
 *******************************************************************************
 * @brief       gpio deinit
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pin                     gpio pin
 * @return      [in/out]  HAL_ERR_NONE            deinit success
 * @return      [in/out]  HAL_ERR_FAIL            deinit failed
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Fini(uint8_t port, uint8_t pin)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pin));
    
    _config(port, pin, GPIO_INIT_MODE);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       deinit gpio
 * @param       [in/out]  *dev                    gpio block
 * @return      [in/out]  HAL_ERR_NONE            deinit success
 * @return      [in/out]  HAL_ERR_FAIL            deinit failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Fini(struct Hal_GPIO_Device *dev)
{
    return Map_GPIO_Fini(dev->Port, dev->Pin);
}

/**
 *******************************************************************************
 * @brief       set gpio
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pin                     gpio pin
 * @return      [in/out]  HAL_ERR_NONE            set success
 * @return      [in/out]  HAL_ERR_FAIL            set failed
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Set(uint8_t port, uint8_t pin)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pin));
    
    _set(port, pin);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       set gpio pin
 * @param       [in/out]  *dev                    gpio block
 * @return      [in/out]  HAL_ERR_NONE            set success
 * @return      [in/out]  HAL_ERR_FAIL            set failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Set(struct Hal_GPIO_Device *dev)
{
    return Map_GPIO_Set(dev->Port, dev->Pin);
}

/**
 *******************************************************************************
 * @brief       clear gpio
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pin                     gpio pin
 * @return      [in/out]  HAL_ERR_NONE            clear success
 * @return      [in/out]  HAL_ERR_FAIL            clear failed
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Clear(uint8_t port, uint8_t pin)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pin));
    
    _clr(port, pin);
    
