yearnext/ysf/bsp/stm32f1xx/map/map_gpio.c
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       clear gpio pin
 * @param       [in/out]  *dev                    gpio block
 * @return      [in/out]  HAL_ERR_NONE            clear success
 * @return      [in/out]  HAL_ERR_FAIL            clear failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Clear(struct Hal_GPIO_Device *dev)
{
    return Map_GPIO_Clear(dev->Port, dev->Pin);
}

/**
 *******************************************************************************
 * @brief       get gpio input status
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pin                     gpio pin
 * @param       [in/out]  *status                 gpio input status
 * @return      [in/out]  HAL_ERR_NONE            success
 * @return      [in/out]  HAL_ERR_FAIL            fail
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_GetIntputStatus(uint8_t port, uint8_t pin, uint16_t *status)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pin));
    
    *status = _get_intput(port, pin);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       get gpio pin intput status
 * @param       [in/out]  *dev                    gpio block
 * @param       [in/out]  *status                 gpio status
 * @return      [in/out]  HAL_ERR_NONE            get success
 * @return      [in/out]  HAL_ERR_FAIL            get failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_GetIntputStatus(struct Hal_GPIO_Device *dev, uint16_t *status)
{
    return Map_GPIO_GetIntputStatus(dev->Port, dev->Pin, status);
}

/**
 *******************************************************************************
 * @brief       get gpio output status
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pin                     gpio pin
 * @param       [in/out]  *status                 gpio output status
 * @return      [in/out]  HAL_ERR_NONE            get success
 * @return      [in/out]  HAL_ERR_FAIL            get fail
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_GetOutputStatus(uint8_t port, uint8_t pin, uint16_t *status)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pin));
    
    *status = _get_output(port, pin);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       get gpio pin output status
 * @param       [in/out]  *dev                    gpio block
 * @param       [in/out]  *status                 gpio status
 * @return      [in/out]  HAL_ERR_NONE            get success
 * @return      [in/out]  HAL_ERR_FAIL            get failed
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_GetOutputStatus(struct Hal_GPIO_Device *dev, uint16_t *status)
{
    return Map_GPIO_GetOutputStatus(dev->Port, dev->Pin, status);
}

/**
 *******************************************************************************
 * @brief       gpio output toggle
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pin                     gpio pin
 * @return      [in/out]  HAL_ERR_NONE            get success
 * @return      [in/out]  HAL_ERR_FAIL            get fail
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Toggle(uint8_t port, uint8_t pin)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pin));
    
    if(_get_output(port, pin))
    {
        _clr(port, pin); 
    }
    else
    {
        _set(port, pin);
    }
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       gpio output toggle
 * @param       [in/out]  *dev                    gpio block
 * @return      [in/out]  HAL_ERR_NONE            set success
 * @return      [in/out]  HAL_ERR_FAIL            set fail
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Toggle(struct Hal_GPIO_Device *dev)
{
    return Map_GPIO_Toggle(dev->Port, dev->Pin);
}

/**
 *******************************************************************************
 * @brief       write gpio port data
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pos                     gpio pin pos
 * @param       [in/out]  wrData                  write data
 * @param       [in/out]  num                     pos num
 * @return      [in/out]  HAL_ERR_NONE            success
 * @return      [in/out]  HAL_ERR_FAIL            fail
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Write(uint8_t port, uint8_t pos, uint16_t wrData, uint8_t num)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pos+num));
    
    GPIO_TypeDef *GPIO = STM32F1XX_PORT_ADDR(port);
    uint16_t portData = _READ_REG(GPIO->ODR);
    uint8_t i;
    
    //< update cache
    for(i=0; i<num; i++)
    {
        portData &= ~(1 << pos);
        
        if(wrData & 0x01)
        {
            portData |= (1 << pos);
        }
        
        wrData >>= 1 ;
        pos++;
    }
    
    //< update param
    _SET_REG(GPIO->BSRR, portData);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       write gpio port data
 * @param       [in/out]  *dev                    gpio block
 * @param       [in/out]  *param                  set param
 * @return      [in/out]  HAL_ERR_NONE            set success
 * @return      [in/out]  HAL_ERR_FAIL            set fail
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Write(struct Hal_GPIO_Device *dev, struct Hal_GPIO_Param *param)
{
    return Map_GPIO_Write(dev->Port, param->Pos, param->RWData, param->Num);
}

/**
 *******************************************************************************
 * @brief       read gpio port data
 * @param       [in/out]  port                    gpio port
 * @param       [in/out]  pos                     gpio pin pos
 * @param       [in/out]  *rdData                 read data
 * @param       [in/out]  num                     pos num
 * @return      [in/out]  HAL_ERR_NONE            success
 * @return      [in/out]  HAL_ERR_FAIL            fail
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Read(uint8_t port, uint8_t pos, uint16_t *rdData, uint8_t num)
{
    hal_assert(IS_PTR_NULL(wrData));
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(pos+num));
    
    GPIO_TypeDef *GPIO = STM32F1XX_PORT_ADDR(port);
    uint16_t portData = _READ_REG(GPIO->IDR);
    uint16_t tempData;
    uint8_t i;
    
    //< update cache
    for(i=0; i<num; i++)
    {
        tempData = portData & (1 << pos);
        
        if(tempData)
        {
            *rdData |= 1 << pos;
        }
    }

