yearnext/ysf/bsp/stm32f1xx/map/map_gpio.c
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       read gpio port data
 * @param       [in/out]  *dev                    gpio block
 * @param       [in/out]  *param                  read param
 * @return      [in/out]  HAL_ERR_NONE            read success
 * @return      [in/out]  HAL_ERR_FAIL            read fail
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Read(struct Hal_GPIO_Device *dev, struct Hal_GPIO_Param *param)
{
    return Map_GPIO_Read(dev->Port, param->Pos, &param->RWData, param->Num);
}

/**
 *******************************************************************************
 * @brief       gpio control
 * @param       [in/out]  *dev                    gpio device block
 * @param       [in/out]  cmd                     set gpio cmd
 * @param       [in/out]  *param                  set param
 * @return      [in/out]  HAL_ERR_NONE            set success
 * @return      [in/out]  HAL_ERR_FAIL            set fail
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_GPIO_Control(struct Hal_GPIO_Device *port, uint8_t cmd, void *param)
{
    hal_assert(IS_PORT_NUM_INVAILD(port));
    hal_assert(IS_PIN_NUM_INVAILD(param));
    
    switch(cmd)
    {
        case GPIO_CMD_OPEN:
        {
            _close(port->Port);
            _open(port->Port);
            break;
        }
        case GPIO_CMD_CLOSE:
        {
            _close(port->Port);
            break;
        }
        case GPIO_CMD_INIT:
        {
            _config(port->Port, port->Pin, port->Mode);
            break;
        }
        case GPIO_CMD_FINI:
        {
            _config(port->Port, port->Pin, GPIO_INIT_MODE);
            break;
        }
        case GPIO_CMD_SET:
        {
            _set(port->Port, port->Pin);
            break;
        }
        case GPIO_CMD_RESET:
        {
            _clr(port->Port, port->Pin);
            break;
        }
        case GPIO_CMD_GET_INPUT:
        {
            uint16_t *status = (uint16_t *)param;
            *status = _get_intput(port->Port, port->Pin);
            break;
        }
        case GPIO_CMD_GET_OUTPUT:
        {
            uint16_t *status = (uint16_t *)param;
            *status = _get_output(port->Port, port->Pin);
            break;
        }
        case GPIO_CMD_TOGGLE:
        {
            if(_get_output(port->Port, port->Pin))
            {
                _clr(port->Port, port->Pin); 
            }
            else
            {
                _set(port->Port, port->Pin);
            }
            break;
        }
        case GPIO_CMD_WRITE:
        {
            struct Hal_GPIO_Param *WrParam = (struct Hal_GPIO_Param *)param;
            Map_GPIO_Write(port->Port, WrParam->Pos, WrParam->RWData, WrParam->Num);
            break;
        }
        case GPIO_CMD_READ:
        {
            struct Hal_GPIO_Param *RdParam = (struct Hal_GPIO_Param *)param;
            Map_GPIO_Read(port->Port, RdParam->Pos, &RdParam->RWData, RdParam->Num);
            break;
        }
        default:
            break;
    }
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       gpio control
 * @param       [in/out]  *dev                    gpio device block
 * @param       [in/out]  cmd                     set gpio cmd
 * @param       [in/out]  *param                  set param
 * @return      [in/out]  HAL_ERR_NONE            set success
 * @return      [in/out]  HAL_ERR_FAIL            set fail
 * @note        This function type is inline
 *******************************************************************************
 */
__INLINE hal_err_t Hal_GPIO_Control(struct Hal_GPIO_Device *dev, uint8_t cmd, void *param)
{
    return Map_GPIO_Control(dev, cmd, param);
}

#endif

/** @}*/     /** map gpio component */

/**********************************END OF FILE*********************************/

